РазработкаОУМобильная/src/InformationRegisters/УГМК_НастройкиРабочихЦентров/УГМК_НастройкиРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УГМК_НастройкиРабочихЦентров</name>
  <resources>
    <name>Доступно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзмененныйПриоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеНастрокиХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.РабочиеМеста</types>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнениеИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеНастроки</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РазработкаОУМобильная/src/Catalogs/ГруппыЗаменяемостиРабочихЦентров/ГруппыЗаменяемостиРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыЗаменяемостиРабочихЦентров</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТребуетсяЗагрузкаПодчиненныхРабочихЦентров</name>
    <comment>Флаг необходимости загрузки подчиненных рабочих центров и групп заменяемости рабочих центров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодчиненныеРабочиеЦентры</name>
    <comment>Таблица подчиненных рабочих центров и групп заменяемости рабочих центров</comment>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/РабочиеЦентры/РабочиеЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеЦентры</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузкаПодчиненныхРабочихЦентров</name>
    <comment>Признак того, что при загрузке данного рабочего центра требуется загрузка других рабочих центров и групп заменяемости рабочих центров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ГруппаПродукцииБаланс</name>
    <type>
      <types>CatalogRef.СК_ГруппыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ОсновноеСредство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодчиненныеРабочиеЦентры</name>
    <comment>Таблица подчиненных рабочих центров</comment>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УГМК_ТипыТехоснасток</name>
    <attributes>
      <name>УГМК_ТипТехоснастки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/СК_ТипыРазмеров/СК_ТипыРазмеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_ТипыРазмеров</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.СК_ГруппыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСечения</name>
    <type>
      <types>CatalogRef.СК_ФормыСечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Мерность</name>
    <type>
      <types>CatalogRef.СК_Мерность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаВеса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРазмераОпределяющийВес</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРазмеров</name>
    <attributes>
      <name>ВидРазмера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтРодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Соединитель</name>
      <type>
        <types>CatalogRef.СК_СоединителиРазмеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерРазмера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерРазмераВОтчетах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОсновной</name>
      <comment>Не указывается в представлении значения размера</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.СК_НДНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/CommonModules/УГМК_СлужебныйПовторноеИспользование/Module.bsl
Процедура ДополнитьМассивЗначениями( РабочиеЦентры, Значение)
	ТипЗнчЗначение = ТипЗнч( Значение);
	
	Если ТипЗнчЗначение = Тип("Массив") или ТипЗнчЗначение = Тип("ФиксированныйМассив") тогда
		Для каждого Зн из Значение цикл
			Если ЗначениеЗаполнено( Зн) тогда
				РабочиеЦентры.Добавить( Зн);
			КонецЕсли;
		КонецЦикла;
	иначеЕсли ТипЗнчЗначение = Тип("Структура") тогда
		Для каждого Зн из Значение цикл
			Если ЗначениеЗаполнено( Зн.Значение) тогда
				РабочиеЦентры.Добавить( Зн.Значение);
			КонецЕсли;
		КонецЦикла;
	иначеЕсли ЗначениеЗаполнено( Значение) тогда
		РабочиеЦентры.Добавить( Значение);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДоступныеЗначенияДляРабочегоЦентра( ТекущийПользователь, Подразделение, РабочийЦентр, ДополнениеИмени = "", ДобавитьВыборИзСправочника = Истина) Экспорт
	Перем РабочиеЦентры, Запр;
	
	РабочиеЦентры = Новый Массив;
	РабочиеЦентры.Добавить( ТекущийПользователь);
	
	ДополнитьМассивЗначениями( РабочиеЦентры, Подразделение);
	ДополнитьМассивЗначениями( РабочиеЦентры, РабочийЦентр);
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("РабочийЦентр", РабочиеЦентры);
	Запр.УстановитьПараметр("ДополнениеИмени", ДополнениеИмени);

	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	             |	Подразделения.Ссылка
	             |ПОМЕСТИТЬ ГруппыЗаменяемостиРабочихЦентров
	             |ИЗ
	             |	Справочник.ГруппыЗаменяемостиРабочихЦентров КАК Подразделения
	             |ГДЕ
	             |	Подразделения.Ссылка В ИЕРАРХИИ(&РабочийЦентр)
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	ГруппыЗаменяемостиРабочихЦентровСостав.Ссылка
	             |ИЗ
	             |	Справочник.ГруппыЗаменяемостиРабочихЦентров.Состав КАК ГруппыЗаменяемостиРабочихЦентровСостав
	             |ГДЕ
	             |	ГруппыЗаменяемостиРабочихЦентровСостав.РабочийЦентр В ИЕРАРХИИ(&РабочийЦентр)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Подразделения.Ссылка
	             |ПОМЕСТИТЬ Подразделения
	             |ИЗ
	             |	Справочник.Подразделения КАК Подразделения
	             |ГДЕ
	             |	Подразделения.Ссылка В ИЕРАРХИИ(&РабочийЦентр)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Подразделения.Ссылка
	             |ПОМЕСТИТЬ РабочиеЦентры
	             |ИЗ
	             |	Справочник.РабочиеЦентры КАК Подразделения
	             |ГДЕ
	             |	Подразделения.Ссылка В ИЕРАРХИИ(&РабочийЦентр)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Подразделения.Ссылка
	             |ПОМЕСТИТЬ Пользователи
	             |ИЗ
	             |	Справочник.Пользователи КАК Подразделения
	             |ГДЕ
	             |	Подразделения.Ссылка В ИЕРАРХИИ(&РабочийЦентр)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ЗначениеНастроки КАК ГруппаПродукции,
	             |	ВЫБОР
	             |		КОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ИзмененныйПриоритет
	             |			ТОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.Приоритет
	             |		КОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки = НЕОПРЕДЕЛЕНО
	             |			ТОГДА -1
	             |		КОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки ССЫЛКА Справочник.Подразделения
	             |			ТОГДА 20
	             |		КОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки ССЫЛКА Справочник.РабочиеМеста
	             |			ТОГДА 15
	             |		КОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки ССЫЛКА Справочник.ГруппыЗаменяемостиРабочихЦентров
	             |			ТОГДА 10
	             |		КОГДА УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки ССЫЛКА Справочник.РабочиеЦентры
	             |				ИЛИ УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки ССЫЛКА Справочник.Пользователи
	             |			ТОГДА 0
	             |		ИНАЧЕ 100
	             |	КОНЕЦ КАК Приоритет
	             |ИЗ
	             |	РегистрСведений.УГМК_НастройкиРабочихЦентров КАК УГМК_ГруппыПродукцииДоступныеРабочимЦентрам
	             |ГДЕ
	             |	(УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки = НЕОПРЕДЕЛЕНО
	             |			ИЛИ УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ОбъектНастройки В
	             |				(ВЫБРАТЬ
	             |					РабочиеМеста.Ссылка
	             |				ИЗ
	             |					Справочник.РабочиеМеста КАК РабочиеМеста
	             |				ГДЕ
	             |					РабочиеМеста.Ссылка В (&РабочийЦентр)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					Подразделения.Ссылка
	             |				ИЗ
	             |					Подразделения КАК Подразделения
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.Подразделения КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							Подразделения.Ссылка
	             |						ИЗ
	             |							Подразделения)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.Подразделения КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							Подразделения.Ссылка
	             |						ИЗ
	             |							Подразделения)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.Подразделения КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							Подразделения.Ссылка
	             |						ИЗ
	             |							Подразделения)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					Подразделения.Ссылка
	             |				ИЗ
	             |					Пользователи КАК Подразделения
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.Пользователи КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							Пользователи.Ссылка
	             |						ИЗ
	             |							Пользователи)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.Пользователи КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							Пользователи.Ссылка
	             |						ИЗ
	             |							Пользователи)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.Пользователи КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							Пользователи.Ссылка
	             |						ИЗ
	             |							Пользователи)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					РабочиеЦентры.Ссылка
	             |				ИЗ
	             |					РабочиеЦентры КАК РабочиеЦентры
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.РабочиеЦентры КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							РабочиеЦентры.Ссылка
	             |						ИЗ
	             |							РабочиеЦентры)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.РабочиеЦентры КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							РабочиеЦентры.Ссылка
	             |						ИЗ
	             |							РабочиеЦентры)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.РабочиеЦентры КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							РабочиеЦентры.Ссылка
	             |						ИЗ
	             |							РабочиеЦентры)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ГруппыЗаменяемостиРабочихЦентров.Ссылка
	             |				ИЗ
	             |					ГруппыЗаменяемостиРабочихЦентров КАК ГруппыЗаменяемостиРабочихЦентров
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель <> ЗНАЧЕНИЕ(Справочник.ГруппыЗаменяемостиРабочихЦентров.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.ГруппыЗаменяемостиРабочихЦентров КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							ГруппыЗаменяемостиРабочихЦентров.Ссылка
	             |						ИЗ
	             |							ГруппыЗаменяемостиРабочихЦентров)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.ГруппыЗаменяемостиРабочихЦентров.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.ГруппыЗаменяемостиРабочихЦентров КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							ГруппыЗаменяемостиРабочихЦентров.Ссылка
	             |						ИЗ
	             |							ГруппыЗаменяемостиРабочихЦентров)
	             |		
	             |				ОБЪЕДИНИТЬ ВСЕ
	             |		
	             |				ВЫБРАТЬ
	             |					ВЫБОР
	             |						КОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.ГруппыЗаменяемостиРабочихЦентров.ПустаяСсылка)
	             |							ТОГДА Подразделения.Ссылка.Родитель.Родитель.Родитель
	             |						ИНАЧЕ Подразделения.Ссылка
	             |					КОНЕЦ
	             |				ИЗ
	             |					Справочник.ГруппыЗаменяемостиРабочихЦентров КАК Подразделения
	             |				ГДЕ
	             |					Подразделения.Ссылка В
	             |						(ВЫБРАТЬ
	             |							ГруппыЗаменяемостиРабочихЦентров.Ссылка
	             |						ИЗ
	             |							ГруппыЗаменяемостиРабочихЦентров)))
	             |	И УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ДополнениеИмени = &ДополнениеИмени
	             |	И УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.Доступно
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Приоритет,
	             |	УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.Порядок,
	             |	УГМК_ГруппыПродукцииДоступныеРабочимЦентрам.ЗначениеНастроки
	             |ИТОГИ ПО
	             |	Приоритет
	             |АВТОУПОРЯДОЧИВАНИЕ";
				 
	ДоступныеГруппы = Новый СписокЗначений;
	Результат = Запр.Выполнить().Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Результат.Следующий() цикл
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			Если ДоступныеГруппы.НайтиПоЗначению( Выборка.ГруппаПродукции) = Неопределено тогда
				ДоступныеГруппы.Добавить( Выборка.ГруппаПродукции);
			КонецЕсли;
		КонецЦикла;
		// у общих данных Приортиет -1, добавляем его и первый неотрицательный Приоритет, остальные отбрасываем.
		Если Результат.Приоритет >= 0 тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеГруппы.Количество() > 0 и ДобавитьВыборИзСправочника тогда
		ДоступныеГруппы.Добавить( Справочники.СК_ГруппыПродукции.ПустаяСсылка(), "Выбрать из справочника....");
	КонецЕсли;
	
	Возврат( ДоступныеГруппы);
КонецФункции

Функция ПолучитьОбразецТипаРеквизита( ГруппаПродукции, ИмяРеквизита, Разделитель = Неопределено) Экспорт
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Настройка", ГруппаПродукции);
	//
	//Разделители = Новый Массив;
	//Разделители.Добавить( Разделитель);
	//Если Разделитель <> Неопределено тогда
	//	Разделители.Добавить( Неопределено);
	//КонецЕсли;
	//Запр.УстановитьПараметр("Разделитель", Разделители);
	//
	//Запр.Текст = "ВЫБРАТЬ
	//             |	ВЫБОР
	//             |		КОГДА УГМК_НастройкиТиповСтрокиДокументаФакта.Разделитель = НЕОПРЕДЕЛЕНО
	//             |			ТОГДА 10
	//             |		ИНАЧЕ 0
	//             |	КОНЕЦ КАК Приоритет,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.Настройка,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.Характеристика,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.Серия,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.Состояние,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.ЕдиницаИзмеренияМест,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.ЕдиницаИзмерения,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.ЕдиницаИзмерения1,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.Коэффициент1,
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.ТипТары
	//             |ИЗ
	//             |	РегистрСведений.УГМК_НастройкиТиповСтрокиДокументаФакта КАК УГМК_НастройкиТиповСтрокиДокументаФакта
	//             |ГДЕ
	//             |	УГМК_НастройкиТиповСтрокиДокументаФакта.Настройка = &Настройка
	//             |	И УГМК_НастройкиТиповСтрокиДокументаФакта.Разделитель В(&Разделитель)
	//             |
	//             |УПОРЯДОЧИТЬ ПО
	//             |	Приоритет";
	//
	//Результат = Запр.Выполнить().Выбрать();
	Значение = Неопределено;
	//Если Результат.Следующий() тогда
	//	Значение = Результат[ ИмяРеквизита];
	//КонецЕсли;
	
	Если Значение = Неопределено тогда
		Если ИмяРеквизита = "Характеристика" тогда
			Значение = Справочники.УГМК_ЗначенияРазмеров.ПустаяСсылка();
		иначеЕсли ИмяРеквизита = "Серия" тогда
			Значение = Справочники.СерииНоменклатуры.ПустаяСсылка();
		иначеЕсли ИмяРеквизита = "Состояние" тогда
			Значение = Справочники.СК_Состояния.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Возврат( Значение);
КонецФункции
//**************************************************************************************************

// Функция возвращает тип размера из справочника СК_ТипыРазмеров.
//
Функция СК_ПолучитьТипРазмераПоПараметрам( ГруппаПродукции, ФормаСечения=Неопределено, Мерность=Неопределено, Стандарт=Неопределено) Экспорт
	
	ГруппаПродукции = ?(ЗначениеЗаполнено( ГруппаПродукции), ГруппаПродукции, Справочники.СК_ГруппыПродукции.ПустаяСсылка());
	ФормаСечения 	= ?(ЗначениеЗаполнено( ФормаСечения), ФормаСечения, Справочники.СК_ФормыСечения.ПустаяСсылка());
	Мерность		= ?(ЗначениеЗаполнено( Мерность), Мерность, Справочники.СК_Мерность.ПустаяСсылка());
	Стандарт		= ?(ЗначениеЗаполнено( Стандарт), Стандарт, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТипыРазмеров.Ссылка КАК ТипРазмера,
	               |	СК_ТипыРазмеров.ГруппаПродукции КАК ГруппаПродукции,
	               |	СК_ТипыРазмеров.ФормаСечения КАК ФормаСечения,
	               |	СК_ТипыРазмеров.Мерность КАК Мерность
	               |ПОМЕСТИТЬ тТипыРазмеров
	               |ИЗ
	               |	Справочник.СК_ТипыРазмеров КАК СК_ТипыРазмеров
	               |ГДЕ
	               |	СК_ТипыРазмеров.ГруппаПродукции = &ГруппаПродукции
	               |	И СК_ТипыРазмеров.ПометкаУдаления = ЛОЖЬ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТипРазмера,
	               |	ГруппаПродукции,
	               |	ФормаСечения,
	               |	Мерность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ТипРазмера,
	               |	МИНИМУМ(ВложенныйЗапрос.Вес) КАК Вес
	               |ПОМЕСТИТЬ тБезУчетаСтандарта
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		1 КАК Вес,
	               |		тТипыРазмеров.ТипРазмера КАК ТипРазмера
	               |	ИЗ
	               |		тТипыРазмеров КАК тТипыРазмеров
	               |	ГДЕ
	               |		тТипыРазмеров.ФормаСечения = &ФормаСечения
	               |		И тТипыРазмеров.Мерность = &Мерность
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		2,
	               |		тТипыРазмеров.ТипРазмера
	               |	ИЗ
	               |		тТипыРазмеров КАК тТипыРазмеров
	               |	ГДЕ
	               |		тТипыРазмеров.ФормаСечения = &ФормаСечения
	               |		И тТипыРазмеров.Мерность = &ПустаяМерность
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		3,
	               |		тТипыРазмеров.ТипРазмера
	               |	ИЗ
	               |		тТипыРазмеров КАК тТипыРазмеров
	               |	ГДЕ
	               |		тТипыРазмеров.ФормаСечения = &ПустаяФормаСечения
	               |		И тТипыРазмеров.Мерность = &Мерность
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		4,
	               |		тТипыРазмеров.ТипРазмера
	               |	ИЗ
	               |		тТипыРазмеров КАК тТипыРазмеров
	               |	ГДЕ
	               |		тТипыРазмеров.ФормаСечения = &ПустаяФормаСечения
	               |		И тТипыРазмеров.Мерность = &ПустаяМерность) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ТипРазмера
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ТипРазмера,
	               |	МИНИМУМ(ВложенныйЗапрос.Вес) КАК Вес
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		тБезУчетаСтандарта.ТипРазмера КАК ТипРазмера,
	               |		тБезУчетаСтандарта.Вес КАК Вес
	               |	ИЗ
	               |		тБезУчетаСтандарта КАК тБезУчетаСтандарта
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		тБезУчетаСтандарта.ТипРазмера,
	               |		тБезУчетаСтандарта.Вес - 0.5
	               |	ИЗ
	               |		тБезУчетаСтандарта КАК тБезУчетаСтандарта
	               |	ГДЕ
	               |		тБезУчетаСтандарта.ТипРазмера.Стандарты.Стандарт = &Стандарт) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ТипРазмера
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вес,
	               |	ВложенныйЗапрос.ТипРазмера.ГруппаПродукции,
	               |	ВложенныйЗапрос.ТипРазмера.ФормаСечения,
	               |	ВложенныйЗапрос.ТипРазмера.Мерность
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ГруппаПродукции", ГруппаПродукции);
	Запрос.УстановитьПараметр("ФормаСечения", ФормаСечения);
	Запрос.УстановитьПараметр("Мерность", Мерность);
	Запрос.УстановитьПараметр("Стандарт", Стандарт);
	Запрос.УстановитьПараметр("ПустаяФормаСечения", Справочники.СК_ФормыСечения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяМерность", Справочники.СК_Мерность.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипРазмера;
	Иначе
		Возврат Справочники.СК_ТипыРазмеров.ПустаяСсылка();	
	КонецЕсли;
КонецФункции

Функция ПолучитьВесовыеЕдиницыИзмерения() Экспорт 
	
	Результат = Новый Массив;
	Результат.Добавить(Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("166"));
	Результат.Добавить(Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("163"));
	Результат.Добавить(Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("168"));
	//тЭл = ПолучитьНастройку("КлассификаторЕдИзм_Килограмм");
	//Если ЗначениеЗаполнено(тЭл) Тогда
	//	Результат.Добавить(тЭл);
	//КонецЕсли;  
	//тЭл = ПолучитьНастройку("КлассификаторЕдИзм_Грамм");
	//Если ЗначениеЗаполнено(тЭл) Тогда
	//	Результат.Добавить(тЭл);
	//КонецЕсли;  
	//тЭл = ПолучитьНастройку("КлассификаторЕдИзм_Тонна");
	//Если ЗначениеЗаполнено(тЭл) Тогда
	//	Результат.Добавить(тЭл);
	//КонецЕсли;  
	Возврат Результат;
	
КонецФункции
